Autodesk.Revit.Exceptions.InvalidDataStreamException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.InvalidDataStreamException
The exception that is thrown when the reading or saving operation failed due to parsing error.